УНФ_ТЕСТ/src/BusinessProcesses/КП_БизнесПроцесс/КП_БизнесПроцесс.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:BusinessProcess>
  <name>КП_БизнесПроцесс</name>
  <task>Task.КП_Задача</task>
  <attributes>
    <name>Автор</name>
    <comment>&quot;Автор&quot; для совместимости с типовыми</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПроцесса</name>
    <type>
      <types>CatalogRef.КП_ВидыПроцессов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДайджестСсылокНаОбъекты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗавершения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДействиеПараллельное</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИднАвтора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИднКонтролера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контролер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаВозвратаВВышестоящийПроцесс</name>
    <comment>Используется при создании процесса из другого процесса</comment>
    <type>
      <types>CatalogRef.КП_ТочкиПроцессов</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеКартыПроцесса</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеТекстаПроцесса</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ВизуальнаяСхемаСкопирована</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>UIDВМобильномКлиенте</name>
    <comment>Заполняется при создании процесса из мобильного клиента</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОсновныеИсполнители</name>
    <attributes>
      <name>ТочкаАдресации</name>
      <type>
        <types>CatalogRef.КП_РолеваяАдресация</types>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтчетИсполнителя</name>
      <type>
        <types>CatalogRef.КП_ТребуемыеРезультатыИсполнителей</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокВыполненияТекст</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИндивидуальныйТекстЗадания</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИндивидуальноеНаименованиеЗадания</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СрокВыполненияЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидНаправленияПараллельное</name>
      <comment>1 - параллельное, 0 - последовательное</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НеИспользоватьГрафикРаботы</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИднИсполнителя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СрокВыполненияДатаВремя</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СетьМаршрутныхТочек</name>
    <attributes>
      <name>ТочкаВыход</name>
      <type>
        <types>CatalogRef.КП_ТочкиПроцессов</types>
      </type>
    </attributes>
    <attributes>
      <name>ТочкаВход</name>
      <type>
        <types>CatalogRef.КП_ТочкиПроцессов</types>
      </type>
    </attributes>
    <attributes>
      <name>УсловныйПереход</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеРеквизита</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяЛинииНаСхеме</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УсловиеПерехода</name>
      <comment>для точки Условия - 0 (нет), 1 (да); для точки ВыборВарианта - номер варианта</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УсловиеПереходаНаименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПроектыБизнесПроцесса</name>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:BusinessProcess>

УНФ_ТЕСТ/src/InformationRegisters/КП_СсылкиПроцессов/КП_СсылкиПроцессов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КП_СсылкиПроцессов</name>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>БизнесПроцесс</name>
    <type>
      <types>BusinessProcessRef.КП_БизнесПроцесс</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DocumentRef</types>
      <types>CatalogRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УНФ_ТЕСТ/src/BusinessProcesses/КП_БизнесПроцесс/ManagerModule.bsl
#Область СлужебныеПроцедурыИФункции

// Процедура выполняет обновление текстовых дайджестов процессов
// Параметры:
//		Нет
Процедура ОбновитьДайджестыПроцессов() Экспорт
	
	Запрос=Новый Запрос("ВЫБРАТЬ
	                    |	КП_СсылкиПроцессов.БизнесПроцесс КАК БизнесПроцесс
	                    |ИЗ
	                    |	РегистрСведений.КП_СсылкиПроцессов КАК КП_СсылкиПроцессов
	                    |ГДЕ
	                    |	КП_СсылкиПроцессов.БизнесПроцесс.ПометкаУдаления = ЛОЖЬ
	                    |ИТОГИ ПО
	                    |	БизнесПроцесс");
						
	Выборка=Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока Выборка.Следующий() Цикл
		
		ПроцессОбъект=Выборка.БизнесПроцесс.ПолучитьОбъект();
		
		Попытка
			ПроцессОбъект.Записать();
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
			Продолжить;
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры
  
// Функция получает данные для печати бизнес-процесса во внешний табличный документ
// Параметры:
//		Документ - содержит ссылку на документ 
//		ФайлСсылка - содержит ссылку на файл шаблона
// Возвращаемое значение: Структура данных
&НаСервере
Функция ПолучитьДанныеПечати(БизнесПроцесс, ФайлСсылка) Экспорт
	
	БизнесПроцессСсылка=БизнесПроцесс.Ссылка;
	ДанныеПоВсемОбъектам = Новый Соответствие;
	
	//соберем данные по документу
	ДанныеОбъектаПоМакетам = Новый Соответствие;
	СтруктураМакета=ПолучитьДанныеОбъекта(БизнесПроцессСсылка, ФайлСсылка);
	Если СтруктураМакета=Неопределено Тогда
		Возврат Новый Структура;
	КонецЕсли;
	
	ДанныеОбъектаПоМакетам.Вставить("макет", СтруктураМакета);
		
	//установим данные документа в соответствие с ним в объекте "Соответствие"
	ДанныеПоВсемОбъектам.Вставить(БизнесПроцессСсылка, ДанныеОбъектаПоМакетам);
	
	//составим соответствие между именем макета и и его двоичными данными (полученными из файла)
	ДвоичныеДанныеМакетов = Новый Соответствие;
	
	ТипыМакетов = Новый Соответствие; //тут будем хранить соответствие имени макета и его типа (DOC или ODT)
	
	ОписаниеОбластей = Новый Соответствие; //тут будем хранить описание областей документа и имени макета

	Если ФайлСсылка.ТекущаяВерсия.Пустая() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Файл не содержит ни одной версии.';en='The file does not contain any version.'"));
		Возврат Новый Структура;
	КонецЕсли;
	
	ДвоичныеДанныеФайлаМакета=КП_РаботаСФайлами.ПолучитьДвоичныеДанныеФайла(ФайлСсылка, ФайлСсылка.ТекущаяВерсия);
	
	РасширениеФайла=ВРег(ФайлСсылка.ТекущаяВерсия.Расширение);
	ТипыМакетов.Вставить("макет", РасширениеФайла); //или ODT
	ДвоичныеДанныеМакетов.Вставить("макет", ДвоичныеДанныеФайлаМакета);
	СтруктураИспользуемыхОбластейМакета=ПолучитьОписаниеОбластейМакетаБизнесПроцесса(ФайлСсылка);
	ОписаниеОбластей.Вставить("макет", СтруктураИспользуемыхОбластейМакета);
											
    //вернем структуру данных печати в которой будут данные документа(ов) и описание макетов для них
	Возврат Новый Структура("Данные, Макеты",
							ДанныеПоВсемОбъектам,
							Новый Структура("ОписаниеОбластей, ТипыМакетов, ДвоичныеДанныеМакетов",
											ОписаниеОбластей,
											ТипыМакетов,
											ДвоичныеДанныеМакетов));
	
КонецФункции

&НаСервере
Функция ПолучитьДанныеОбъекта(СсылкаНаОбъект, ФайлСсылка)
	
	Объект = СсылкаНаОбъект.Ссылка.ПолучитьОбъект();
	
	ДанныеОбъекта = Новый Структура;
	
	//выберем данные по запросу к подчиненному справочнику
	Запрос=Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
						 |	КП_ПараметрыШаблоновФайлов.Ссылка,
						 |	КП_ПараметрыШаблоновФайлов.ИсточникДанных КАК ИсточникДанных,
						 |	КП_ПараметрыШаблоновФайлов.ИсточникДанных.Реквизит КАК Реквизит,
						 |	КП_ПараметрыШаблоновФайлов.ИсточникДанных.ТабличнаяЧасть КАК ТабличнаяЧасть,
						 |	КП_ПараметрыШаблоновФайлов.ИсточникДанных.ТочкаТаблицыБизнесПроцесса КАК ТочкаТаблицыБизнесПроцесса,
						 |	КП_ПараметрыШаблоновФайлов.ИсточникДанных.Дополнение КАК Дополнение,
						 |	КП_ПараметрыШаблоновФайлов.ИсточникДанных.ТипДанныхТега КАК ТипДанных,
						 |	КП_ПараметрыШаблоновФайлов.ИсточникДанных.ИсточникДанныхОснование КАК ИсточникДанныхОснование,
						 |	КП_ПараметрыШаблоновФайлов.ИсточникДанных.НомерСтрокиТабличнойЧасти КАК НомерСтрокиТабличнойЧасти,
						 |	КП_ПараметрыШаблоновФайлов.ИсточникДанных.ФункцияПреобразования КАК ФункцияПреобразования,
						 |	КП_ПараметрыШаблоновФайлов.ИсточникДанных.СтрокаФормата КАК СтрокаФормата,
						 |	КП_ПараметрыШаблоновФайлов.Наименование КАК Наименование
						 |ИЗ
						 |	Справочник.КП_ПараметрыШаблоновФайлов КАК КП_ПараметрыШаблоновФайлов
						 |ГДЕ
						 |	КП_ПараметрыШаблоновФайлов.ПометкаУдаления = ЛОЖЬ
						 |	И КП_ПараметрыШаблоновФайлов.Владелец = &Владелец
						 |	И КП_ПараметрыШаблоновФайлов.Отключено = ЛОЖЬ");
						 
	Запрос.УстановитьПараметр("Владелец", ФайлСсылка);
	Выборка=Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.Прямой);
	Если Выборка.Количество()=0 Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Не задан ни один параметр шаблона. Вывод не будет выполнен.';en='Do not set any template parameter. Withdrawal has been completed.'"));
		Возврат Неопределено;
		
	КонецЕсли;
	
	Пока Выборка.Следующий() Цикл
		ШаблонПараметров=Выборка.Ссылка;
		
		ИмяИсточника=СокрЛП(Выборка.Наименование);
		ИмяРеквизита=СокрЛП(Выборка.Реквизит);			
		ИмяДополнения=СокрЛП(Выборка.Дополнение);
		
		ТипДанных=Выборка.ТипДанных;
		Если ТипДанных=Перечисления.КП_ТипыДанныхТегов.Функция 
			ИЛИ ТипДанных=Перечисления.КП_ТипыДанныхТегов.Системное 
			ИЛИ ТипДанных=Перечисления.КП_ТипыДанныхТегов.ИсточникДанных
			ИЛИ ТипДанных=Перечисления.КП_ТипыДанныхТегов.ПараметрБизнесПроцесса 
			ИЛИ ТипДанных=Перечисления.КП_ТипыДанныхТегов.ПеременнаяБизнесПроцесса
			ИЛИ (ТипДанных=Перечисления.КП_ТипыДанныхТегов.ТаблицаБизнесПроцесса И Выборка.НомерСтрокиТабличнойЧасти>0)
		Тогда
			
			ДанныеИсточника=КП_ОбщееСервер.ПолучитьДанныеИсточника(Выборка.ИсточникДанных, СсылкаНаОбъект, ИмяИсточника);
			ДанныеИсточника=КП_ОбщееСервер.ПрименитьФункциюПреобразования(ДанныеИсточника, Выборка.Ссылка);
			
			ДанныеОбъекта.Вставить(ИмяИсточника, СокрЛП(ДанныеИсточника));
			
		ИначеЕсли ТипДанных=Перечисления.КП_ТипыДанныхТегов.ТаблицаБизнесПроцесса Тогда
	
			//возможно два варианта обработки табличных частей, простой по конкеретному номеру и как массив
			
			Если Выборка.НомерСтрокиТабличнойЧасти=0 Тогда
				//обработка массива строк табличных частей
				//ДанныеОбъекта.Вставить(ИмяИсточника, СокрЛП(ДанныеИсточника));
				//ДанныеОбъекта=ДанныеИсточника;
				
				ДанныеИсточника=КП_ОбщееСервер.ПолучитьДанныеИсточника(Выборка.ИсточникДанных, СсылкаНаОбъект, ИмяИсточника, ДанныеОбъекта);	
				//ДанныеОбъекта.Вставить(ИмяТабличнойЧасти, ДанныеИсточника);
				
			КонецЕсли;

			
		ИначеЕсли ТипДанных=Перечисления.КП_ТипыДанныхТегов.ПрограммнаяТаблицаЗначений Тогда
			
			ДанныеИсточника=КП_ОбщееСервер.ПолучитьДанныеИсточника(Выборка.ИсточникДанных, СсылкаНаОбъект, ИмяИсточника, ДанныеОбъекта);	
   			ДанныеОбъекта.Вставить(ИмяИсточника, СокрЛП(ДанныеИсточника));
			Продолжить;
			
		КонецЕсли;
		
	КонецЦикла;
		
	//возвращается структура описывающая реквизиты объекта, при этом:
	//а) реквизит шапки представлен отдельной записью структуры
	//б) табличная часть представлена отдельной записью структуры с типом "Массив"
	//в таком массиве находятся элементы, каждый их которых содержит структуру реквизитов 
	//строки табличной части
	
	Возврат ДанныеОбъекта;
	
КонецФункции

&НаСервере
Функция ПолучитьОписаниеОбластейМакетаБизнесПроцесса(ФайлСсылка)
	                          
	ОписаниеОбластей = Новый Структура; //возвращается структура, содержащая имена областей и их типы
	
	//заполним выборкой по подчиненному файлу справочнику
	
	//ВыборкаОбласти=аДОРаботаСФайлами.ПолучитьВыборкуОбластейШаблона(ФайлСсылка);
	Запрос=Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                    |	КП_ОбластиШаблоновФайлов.Наименование,
	                    |	КП_ОбластиШаблоновФайлов.ТипОбласти,
	                    |	КП_ОбластиШаблоновФайлов.ПорядокВывода КАК ПорядокВывода
	                    |ИЗ
	                    |	Справочник.КП_ОбластиШаблоновФайлов КАК КП_ОбластиШаблоновФайлов
	                    |ГДЕ
	                    |	КП_ОбластиШаблоновФайлов.ПометкаУдаления = ЛОЖЬ
	                    |	И КП_ОбластиШаблоновФайлов.Владелец = &Файл
	                    |	И КП_ОбластиШаблоновФайлов.Отключено = ЛОЖЬ
	                    |
	                    |УПОРЯДОЧИТЬ ПО
	                    |	ПорядокВывода ВОЗР");
						
	Запрос.УстановитьПараметр("Файл", ФайлСсылка);
	
	ВыборкаОбласти=Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.Прямой);
	
	Пока ВыборкаОбласти.Следующий() Цикл
		ИмяОбласти=СокрЛП(ВыборкаОбласти.Наименование);
		ИмяОбласти=КП_ФормированиеПоШаблонам.ПолучитьПреобразованныйТипОбласти(ИмяОбласти);
		УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, ИмяОбласти, СокрЛП(ВыборкаОбласти.ТипОбласти));
	КонецЦикла;
			
	Возврат ОписаниеОбластей;
	
КонецФункции

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	Поля.Добавить("Наименование");
	Поля.Добавить("Номер");
	Поля.Добавить("Дата");

КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	Представление=Данные.Наименование+" № "+СокрЛП(Данные.Номер)+НСтр("ru=' от ';en=' ';")+Формат(Данные.Дата, "ДФ='dd.MM.yyyy HH:mm'");

КонецПроцедуры

#КонецОбласти

// Заполняет список получателей SMS при отправке сообщения сформированного по шаблону.
//
// Параметры:
//   ПолучателиSMS - ТаблицаЗначений - список получается SMS.
//     * НомерТелефона - Строка - номер телефона, куда будет отправлено сообщение SMS.
//     * Представление - Строка - представление получателя сообщения SMS.
//     * Контакт       - Произвольный - контакт, которому принадлежит номер телефона.
//  ПредметСообщения - ЛюбаяСсылка, Структура - ссылка на объект являющийся источником данных, либо структура,
//    * Предмет               - ЛюбаяСсылка - ссылка на объект являющийся источником данных
//    * ПроизвольныеПараметры - Соответствие - заполненный список произвольных параметров.//
//
Процедура ПриЗаполненииТелефоновПолучателейВСообщении(ПолучателиSMS, ПредметСообщения) Экспорт
	
КонецПроцедуры
